package Lesson_3.Homework;

/**
 * Задание:
 * 1. Создать массив с набором слов (10-20 слов, должны встречаться повторяющиеся). Найти и вывести список уникальных слов,
 * из которых состоит массив (дубликаты не считаем). Посчитать, сколько раз встречается каждое слово.
 * 2. Написать простой класс Телефонный Справочник, который хранит в себе список фамилий и телефонных номеров.
 * В этот телефонный справочник с помощью метода add() можно добавлять записи, а с помощью метода get() искать номер телефона по фамилии.
 * Следует учесть, что под одной фамилией может быть несколько телефонов (в случае однофамильцев), тогда при запросе такой фамилии должны выводиться все телефоны.
 */

import java.util.*;


public class MainHW3 {
    public static void main(String[] args) {

        Words words = new Words();
        System.out.println(words);
        //phoneBook

        PhoneBook phoneBook = new PhoneBook();
        //phoneBook.get("")
//        System.out.println(phoneBook);




    }
}





